org/RforS-II-06.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-06 木 09:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Rによるやさしい統計学 入門統計学 6章 2つの平均値を比較する</title>
<meta name="author" content="suzuki@iwate-u.ac.jp 鈴木正幸，非常勤講師 suzuki@iwate-u.ac.jp 鈴木正幸，非常勤講師" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://wiki.cis.iwate-u.ac.jp/~suzuki/org-html-theme/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://wiki.cis.iwate-u.ac.jp/~suzuki/org-html-theme/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Rによるやさしい統計学 入門統計学 6章 2つの平均値を比較する</h1>


<div id="outline-container-orgcb54dbb" class="outline-2">
<h2 id="orgcb54dbb">6.0 この章での検定</h2>
<div class="outline-text-2" id="text-orgcb54dbb">
<ol class="org-ol">
<li>独立な2群の平均値の差の検定</li>

<li>対応のある2群の平均値の差の検定</li>
</ol>
</div>
</div>

<div id="outline-container-org38f9a7f" class="outline-2">
<h2 id="org38f9a7f">6.1 2つの平均値を比較するケース</h2>
<div class="outline-text-2" id="text-org38f9a7f">
<ul class="org-ul">
<li>男女で心理学テストの平均値に差があるかを検討したい。</li>

<li>統計が好き・嫌いで統計テストの平均値に差があるかを検討したい。</li>

<li>統計の指導を受けたことにより成績が向上するかを検討したい。</li>
</ul>
</div>
</div>


<div id="outline-container-org215f21c" class="outline-2">
<h2 id="org215f21c">6.2 独立な2群の検定</h2>
<div class="outline-text-2" id="text-org215f21c">
</div>
<div id="outline-container-org260b61d" class="outline-3">
<h3 id="org260b61d">分散既知 あるいは 大標本の場合 (z-検定)</h3>
<div class="outline-text-3" id="text-org260b61d">
<p>
確率変数の和の平均と分散の期待値の公式より，標本平均の差の標本分
布は，
</p>

\begin{equation}
\bar{x_1} - \bar{x_2} \sim N(\mu_1-\mu_2, \sigma^2(\frac{1}{n_1}+\frac{1}{n_2}))
\end{equation}

<p>
標準化することで，
</p>

<p>
\[
    \bar{Z} = 
    \frac{\bar{X_1} - \bar{X_2} -
    (\mu_1-\mu_2)}{\sigma\sqrt{\frac{1}{n_1}+\frac{1}{n_2}}}
    \sim N(0,1)
    \]
</p>
</div>
</div>

<div id="outline-container-org4fac15e" class="outline-3">
<h3 id="org4fac15e">分散未知の場合 (t-検定)</h3>
<div class="outline-text-3" id="text-org4fac15e">
<p>
母分散を不偏分散で推定する。
標本平均の不偏分散を \( \hat{\sigma_1} \), \( \hat{\sigma_2} \)
\) とすると，標本平均の差の不偏分散は，その加重平均となる：
</p>

<p>
\[
    \hat{\sigma}^2_{pooled} = \frac{(n_1-1)\hat{\sigma_1}^2 +
    (n_2-1)\hat{\sigma_2}^2}
    {(n_1-1) + (n_2 -1)}
    \]
</p>

<p>
母分散の推定量 \( \hat{\sigma}^2_{pooled} \) のことを，2群をプールし
た分散という。
</p>

<p>
\[
    \bar{t} = 
    \frac{\bar{X_1} - \bar{X_2}}{\sqrt{\hat{\sigma}_{pooled}^2(\frac{1}{n_1}+\frac{1}{n_2}})}
    \sim t_{(n_1-1)+(n_2-2)}
    \]
</p>
</div>
</div>


<div id="outline-container-orgb43dbd7" class="outline-3">
<h3 id="orgb43dbd7">例題</h3>
<div class="outline-text-3" id="text-orgb43dbd7">
<p>
統計テスト1の得点の平均値に男女で有意な差があるでしょうか？
有意水準5%，両側検定してください。
</p>
</div>

<div id="outline-container-org2bc2cf0" class="outline-4">
<h4 id="org2bc2cf0">データの準備</h4>
<div class="outline-text-4" id="text-org2bc2cf0">
<div class="org-src-container">
<pre class="src src-R">
     (&#25351;&#23566;&#27861;&#12487;&#12540;&#12479; <span style="color: #e5786d;">&lt;-</span> read.csv(<span style="color: #95e454;">"data/shidouhouU8.csv"</span>))
     class(&#25351;&#23566;&#27861;&#12487;&#12540;&#12479;)

</pre>
</div>

<pre class="example" id="orgc00e263">
	SID   name sex math stat psych_test stat_test1 stat_test2 method
     1    1   大村  男 嫌い 好き         13          6         10      C
     2    2   本多  男 嫌い 好き         14         10         13      B
     3    3   川崎  男 好き 好き          7          6          8      B
     4    4   多村  男 好き 好き         12         10         15      A
     5    5   松中  男 嫌い 嫌い         10          5          8      B
     6    6 小久保  男 嫌い 嫌い          6          3          6      C
     7    7   柴原  男 嫌い 嫌い          8          5          9      A
     8    8   井手  男 嫌い 嫌い         15          9         10      D
     9    9   田上  男 嫌い 嫌い          4          3          7      D
     10  10   松田  男 好き 嫌い         14          3          3      D
     11  11   高谷  女 好き 好き          9         11         18      A
     12  12   杉内  女 嫌い 好き          6          6         14      A
     13  13   和田  女 好き 好き         10         11         18      A
     14  14   新垣  女 嫌い 嫌い         12          9         11      C
     15  15   大隣  女 嫌い 好き          5          7         12      B
     16  16   水田  女 好き 嫌い         12          5          5      D
     17  17   斉藤  女 嫌い 嫌い          8          8          7      C
     18  18   柳瀬  女 嫌い 嫌い          8          7         12      C
     19  19   佐藤  女 嫌い 嫌い         12          7          7      B
     20  20   馬原  女 嫌い 嫌い         15          9          7      D
     [1] "data.frame"
</pre>
</div>

<div id="outline-container-org58c8c5c" class="outline-5">
<h5 id="org58c8c5c">男女別</h5>
<div class="outline-text-5" id="text-org58c8c5c">
<div class="org-src-container">
<pre class="src src-R">
(&#32113;&#35336;1&#30007; <span style="color: #e5786d;">&lt;-</span> subset(&#25351;&#23566;&#27861;&#12487;&#12540;&#12479;, sex==<span style="color: #95e454;">"&#30007;"</span>)$stat_test1)
(&#32113;&#35336;1&#22899; <span style="color: #e5786d;">&lt;-</span> subset(&#25351;&#23566;&#27861;&#12487;&#12540;&#12479;, sex==<span style="color: #95e454;">"&#22899;"</span>)$stat_test1)

</pre>
</div>

<pre class="example">
[1]  6 10  6 10  5  3  5  9  3  3
[1] 11  6 11  9  7  5  8  7  7  9
</pre>
</div>
</div>
</div>



<div id="outline-container-orgf4592bf" class="outline-4">
<h4 id="orgf4592bf">t-検定 (等母分散)</h4>
<div class="outline-text-4" id="text-orgf4592bf">
<p>
母分散が等しいことを前提としているので，2群の分散が等しいことを
示す var.equal=TRUE を指定する。
</p>

<div class="org-src-container">
<pre class="src src-R">
      t.test(&#32113;&#35336;1&#30007;, &#32113;&#35336;1&#22899;, var.equal=<span style="color: #92a65e; font-weight: bold;">TRUE</span>)

</pre>
</div>

<pre class="example" id="org7264a4a">

	      Two Sample t-test

      data:  統計1男 and 統計1女
      t = -1.8429, df = 18, p-value = 0.08188
      alternative hypothesis: true difference in means is not equal to 0
      95 percent confidence interval:
       -4.2800355  0.2800355
      sample estimates:
      mean of x mean of y 
	      6         8
</pre>
</div>
</div>


<div id="outline-container-orgccc2d03" class="outline-4">
<h4 id="orgccc2d03">t-検定 (異なる母分散)</h4>
<div class="outline-text-4" id="text-orgccc2d03">
<p>
2群の分散が等しくないいことを
示す var.equal=FALSE を指定する。
</p>

<p>
帰無分布は同じく t-分布であるが、自由度が異なる
(統計学入門，12.2.4)
</p>

<div class="org-src-container">
<pre class="src src-R">
      t.test(&#32113;&#35336;1&#30007;, &#32113;&#35336;1&#22899;, var.equal=<span style="color: #92a65e; font-weight: bold;">FALSE</span>)

</pre>
</div>

<pre class="example" id="org0a6198d">

	      Welch Two Sample t-test

      data:  統計1男 and 統計1女
      t = -1.8429, df = 16.321, p-value = 0.08359
      alternative hypothesis: true difference in means is not equal to 0
      95 percent confidence interval:
       -4.2969668  0.2969668
      sample estimates:
      mean of x mean of y 
	      6         8
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org5a9c29a" class="outline-2">
<h2 id="org5a9c29a">6.3 t-検定の前提条件</h2>
<div class="outline-text-2" id="text-org5a9c29a">
<ol class="org-ol">
<li>標本抽出が無作為に行われていること</li>
<li>母集団の分布が正規分布であること</li>
<li>2つの母集団の分散が等質であること</li>
</ol>

<p>
3つの条件は，帰無分布が t-分布になるために必要です。
</p>
</div>


<div id="outline-container-org8775bd2" class="outline-3">
<h3 id="org8775bd2">6.3.1 分散の等質性の検定</h3>
<div class="outline-text-3" id="text-org8775bd2">
<ul class="org-ul">
<li>2つの母集団の分散の等質性を，</li>
<li>それぞれの母集団からの2つの標本を用いて，</li>
<li>「ふたつの母分散は等しい」という帰無仮説の検定をおこなう</li>
<li>R では， var.test</li>
</ul>
</div>


<div id="outline-container-org514a372" class="outline-4">
<h4 id="org514a372">例題</h4>
<div class="outline-text-4" id="text-org514a372">
<p>
クラスA,Bの統計学のテストの平均点に有意な差があるでしょうか？
有意水準5%で検定を行ってください。
</p>
</div>

<div id="outline-container-orgd413f6b" class="outline-5">
<h5 id="orgd413f6b">データ</h5>
<div class="outline-text-5" id="text-orgd413f6b">
<div class="org-src-container">
<pre class="src src-R">
(&#12463;&#12521;&#12473;A <span style="color: #e5786d;">&lt;-</span> c(54, 55, 52, 48, 50, 38, 41, 40, 53, 52))
(&#12463;&#12521;&#12473;B <span style="color: #e5786d;">&lt;-</span> c(57, 63, 50, 60, 61, 69, 43, 58, 36, 29))
var.test(&#12463;&#12521;&#12473;A, &#12463;&#12521;&#12473;B)

</pre>
</div>

<pre class="example" id="org5bc0c7d">
	[1] 54 55 52 48 50 38 41 40 53 52
	[1] 57 63 50 60 61 69 43 58 36 29

	       F test to compare two variances

       data:  クラスA and クラスB
       F = 0.24157, num df = 9, denom df = 9, p-value = 0.04588
       alternative hypothesis: true ratio of variances is not equal to 1
       95 percent confidence interval:
	0.06000201 0.97255026
       sample estimates:
       ratio of variances 
		0.2415677
</pre>
</div>
</div>
</div>
</div>
</div>


<div id="outline-container-org6707332" class="outline-2">
<h2 id="org6707332">6.4 対応のある (z,t)-検定</h2>
<div class="outline-text-2" id="text-org6707332">
<dl class="org-dl">
<dt>独立な2群 or 対応のない2群</dt><dd>例えば30人の被験者を，ランダムに2群に分た場合</dd>

<dt>対応のある2群</dt><dd>同じ人の2種類のデータ。対応付られた2人ごとのデータ。</dd>
</dl>
</div>

<div id="outline-container-orgf65d576" class="outline-3">
<h3 id="orgf65d576">対応のあるデータの検定量</h3>
<div class="outline-text-3" id="text-orgf65d576">
<p>
統計テスト1の得点を \( X_1 \),
統計テスト2の得点を \( X_2 \),
対応する得点差を \( D  = X_2 - X_1 \), とすると，それらの標本平
均にたいし，下式が成り立つ:
</p>

<p>
\[
       \bar{D} = \bar{X}_2 - \bar{X}_1
      \]
</p>
</div>

<div id="outline-container-org061e34d" class="outline-4">
<h4 id="org061e34d">得点差の標本平均の計算</h4>
<div class="outline-text-4" id="text-org061e34d">
<div class="org-src-container">
<pre class="src src-R">
     &#25351;&#23566;&#27861;&#12487;&#12540;&#12479; <span style="color: #e5786d;">&lt;-</span> read.csv(<span style="color: #95e454;">"data/shidouhouU8.csv"</span>)

     (&#32113;&#35336;&#12486;&#12473;&#12488;1 <span style="color: #e5786d;">&lt;-</span> &#25351;&#23566;&#27861;&#12487;&#12540;&#12479;$stat_test1)
     (&#32113;&#35336;&#12486;&#12473;&#12488;2 <span style="color: #e5786d;">&lt;-</span> &#25351;&#23566;&#27861;&#12487;&#12540;&#12479;$stat_test2)
     (&#22793;&#21270;&#37327; <span style="color: #e5786d;">&lt;-</span> &#32113;&#35336;&#12486;&#12473;&#12488;2 - &#32113;&#35336;&#12486;&#12473;&#12488;1)
     c(mean(&#32113;&#35336;&#12486;&#12473;&#12488;2) - mean(&#32113;&#35336;&#12486;&#12473;&#12488;1), mean(&#22793;&#21270;&#37327;))

</pre>
</div>

<pre class="example">
 [1]  6 10  6 10  5  3  5  9  3  3 11  6 11  9  7  5  8  7  7  9
 [1] 10 13  8 15  8  6  9 10  7  3 18 14 18 11 12  5  7 12  7  7
 [1]  4  3  2  5  3  3  4  1  4  0  7  8  7  2  5  0 -1  5  0 -2
[1] 3 3
</pre>
</div>
</div>





<div id="outline-container-org042d5db" class="outline-4">
<h4 id="org042d5db">得点差の標本平均が従がう分布</h4>
<div class="outline-text-4" id="text-org042d5db">
<ul class="org-ul">
<li>\( X_i \sim N(\mu_{i}, \sigma^2_{i}) \) を仮定すれば，</li>
<li>\( D \sim N(\mu_{D}, \sigma^2_{D}) \)  となり，</li>
<li>標本分布は，\( \bar{D} \sim N(\mu_{D},	  \frac{\sigma^2_{D}}{n}) \) となる。</li>
<li>\( \bar{D} \) を標準化して, \( n \)を標本数として，
\[
	 Z = \frac {\bar{D} - \mu_{D}} {\sigma_{D} \sqrt{n}} \sim N(0,1)
	 \]</li>
<li>\(\sigma^2_D \) が既知ならば，z-検定</li>
<li>\(\sigma^2_D \) が未知ならば，不偏分散を用いたt-検定</li>
</ul>
</div>
</div>

<div id="outline-container-orgf51693a" class="outline-4">
<h4 id="orgf51693a">例題：</h4>
<div class="outline-text-4" id="text-orgf51693a">
<p>
「指導法データ」の統計テスト1と統計テスト2の得点について、指導
の前後で統計テストの得点が変化したといえるでしょうか。有意水準
5％、両側検定で検定してください。
</p>

<div class="org-src-container">
<pre class="src src-R">
        t.test(&#22793;&#21270;&#37327;)

</pre>
</div>

<pre class="example" id="org24fb732">

		One Sample t-test

	data:  変化量
	t = 4.8399, df = 19, p-value = 0.0001138
	alternative hypothesis: true mean is not equal to 0
	95 percent confidence interval:
	 1.702645 4.297355
	sample estimates:
	mean of x 
		3
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: suzuki@iwate-u.ac.jp 鈴木正幸，非常勤講師 suzuki@iwate-u.ac.jp 鈴木正幸，非常勤講師</p>
<p class="date">Created: 2022-01-06 木 09:20</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
